GenevGitHub/Genev_CC2652R7_Firmware/Application/brake_and_throttle.c
    #ifdef MOTOR_0RPM_START_MODE
        if (brakeStatus)
        {
            IQ_input = 0;
            throttlePercentApplied = 0;
        }
        else
        {
            if (throttlePercent > throttlePercentApplied)
            {
                if ((throttlePercent - throttlePercentApplied) > THROTTLE_INCREMENT_LIMIT)
                {
                    throttlePercentApplied += THROTTLE_INCREMENT_LIMIT;    // throttle percent increase limited to "THROTTLE_INCREMENT_LIMIT"% at any time
                }
                else
                {
                    throttlePercentApplied = throttlePercent;
                }
            }
            else
            {
                throttlePercentApplied = throttlePercent;
            }
            IQ_input = speedModeIQmax * throttlePercentApplied / 100;
        }
    #endif  // MOTOR_0RPM_START_MODE
    }
    else
    {
        if (throttlePercent > throttlePercentApplied)
        {
            if ((throttlePercent - throttlePercentApplied) > THROTTLE_INCREMENT_LIMIT)
            {
                throttlePercentApplied += THROTTLE_INCREMENT_LIMIT;    // throttle percent increase limited to "THROTTLE_INCREMENT_LIMIT"% at any time
            }
            else
            {
                throttlePercentApplied = throttlePercent;
            }
        }
        else
        {
            throttlePercentApplied = throttlePercent;
        }
        IQ_input = speedModeIQmax * throttlePercentApplied / 100;
    }

    brake_and_throttle_OutputPowerLimitAlgorithm();

    IQ_applied = IQ_input;
}

/*********************************************************************
 * @fun    brake_and_throttle_normalLawAlgorithm
 *
 * @brief   Normal Law Algorithm
 *
 * @param   Nil
 *
 * @return  Nil
 *********************************************************************/
static void brake_and_throttle_normalLawAlgorithm()
{
    /** To get here,
     * (1) RPM status is 1, i.e., RPM is positive
     * (2) No fatal errors
     ***/

    if ((brakeStatus) || (RPM_temp < REG_MINP_RPM)) /* if brake is activated or rpm is less than the min power rpm */
    {
    #ifndef MOTOR_0RPM_START_MODE
        IQ_input = 0;
    #endif  // MOTOR_0RPM_START_MODE

    #ifdef MOTOR_0RPM_START_MODE
        if (brakeStatus)
        {
            IQ_input = 0;
        }
        else
        {
            throttleSpeedControlAlgorithm();
        }
    #endif  // MOTOR_0RPM_START_MODE
    }
    else
    {
        throttleSpeedControlAlgorithm();
    }

    brake_and_throttle_OutputPowerLimitAlgorithm();
    IQ_applied = IQ_input;
}

/*********************************************************************
 * @fun    throttleSpeedControlAlgorithm
 *
 * @brief   Speed Control Algorithm
 *
 * @param   Nil
 *
 * @return  Nil
 *********************************************************************/
uint8_t OPL_exceedance = 0; // debugging

static void throttleSpeedControlAlgorithm()
{
    IQ_increment = speedModeIQmax / NN_IQ_INCREMENTS;

    /*******************************   1. Speed limit algorithm  **************************************/
    if (throttleSpeedControl < REG_MINP_RPM)
    {   // when the equivalent throttle speed is less than the min motor powered rpm, IQ = 0
        alpha = (float) 0;
        IQ_input = 0;
    }
    else
    {
        if (throttleSpeedControl >= RPM_temp)   // RPM_temp is >= min powered rpm
        {
            if (abs(throttleSpeedControl - RPM_temp) < 8)  // difference in rpm less than "x" rpm (8 rpm = 0.3 km/h)
            {
                alpha = (float) 0;
            }
            else
            {
                alpha = (float)(throttleSpeedControl - RPM_temp) / (throttleSpeedControl);
            }
            IQ_input = (uint16_t) (IQ_input + (float) alpha * IQ_increment);

            if (IQ_input > speedModeIQmax)
            {
                IQ_input = speedModeIQmax;
            }
        }
        else    //else if (throttleSpeedControl < RPM_temp)
        {
            if (abs(RPM_temp - throttleSpeedControl) < 5)  // difference in rpm less than "x" rpm (8 rpm = 0.3 km/h)
            {
                alpha = (float) 0;
            }
            else
            {
                alpha = (float)(throttleSpeedControl - RPM_temp) / (throttleSpeedControl);
                if (alpha < -1)
                {
                    alpha = -1;
                }
            }
            if ((IQ_input + (float) alpha * IQ_increment) <= 0)
            {
                IQ_input = 0;
            }
            else
            {
                IQ_input = IQ_input + (float) alpha * IQ_increment;
            }
        }
    }
}

///*********************************************************************
// * @fun    brake_and_throttle_OutputPowerLimitAlgorithm
// *
// * @brief   Output Power Limit Protection
// *
// * @param   Nil
// *
// * @return  Nil
// *********************************************************************/
static void brake_and_throttle_OutputPowerLimitAlgorithm()
{
    /**********************  2. Output Power Limit Protection  **********************************************/
    if ((REG_MAXPOUT / (RPM_temp * 2 * PI_CONSTANT / 60) / KT_CONSTANT / KIQ_CONSTANT) > speedModeIQmax)
    {
        IQ_maxPout = speedModeIQmax;
    }
    else
    {
        IQ_maxPout = (float) REG_MAXPOUT / (RPM_temp * 2 * PI_CONSTANT / 60) / KT_CONSTANT / KIQ_CONSTANT;
    }

    if (IQ_input > IQ_maxPout)
    {
        IQ_input = IQ_maxPout;    // making sure IQ applied will not exceed allowable output power limit
        OPL_exceedance ++;
    }
}

/*********************************************************************
 * @fn      brakeAndThrottle_getSpeedModeParams
 *
 * @brief   Get speed Mode parameters
 *
 * @param   speedMode
 *
 * @return  none
 *********************************************************************/
extern void brake_and_throttle_getSpeedModeParams()
{
    switch(speedMode)
    {
    case BRAKE_AND_THROTTLE_SPEED_MODE_AMBLE:                   // Amble mode
        {
            if (ControlLaw == BRAKE_AND_THROTTLE_DIRECTLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_AMBLE;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_SPORTS * 1.5;
            }
            else if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_AMBLE;
            }
            rampRate = BRAKE_AND_THROTTLE_RAMPRATE_AMBLE;
            break;
        }
    case BRAKE_AND_THROTTLE_SPEED_MODE_LEISURE:                 // Leisure mode
        {
            if (ControlLaw == BRAKE_AND_THROTTLE_DIRECTLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_LEISURE;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_SPORTS * 1.5;
            }
            else if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_LEISURE;
            }
            rampRate = BRAKE_AND_THROTTLE_RAMPRATE_LEISURE;
            break;
        }
    case BRAKE_AND_THROTTLE_SPEED_MODE_SPORTS:                  // Sports mode
        {
            if (ControlLaw == BRAKE_AND_THROTTLE_DIRECTLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_SPORTS * 1.5;
            }
            else if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_SPORTS;
            }
            rampRate = BRAKE_AND_THROTTLE_RAMPRATE_SPORTS;
            break;
        }
    default:
        break;
    }
    speedModeIQmax = reductionRatio * STM32MCP_TORQUEIQ_MAX / 100;

    /* Send updated speed mode parameters to motor control unit */
    /*  these following codes are necessary for control law change  */
    ptr_bat_STM32MCPDArray->speed_mode = speedMode;
    ptr_bat_STM32MCPDArray->speed_mode_IQmax = speedModeIQmax;
    ptr_bat_STM32MCPDArray->ramp_rate = rampRate;
    ptr_bat_STM32MCPDArray->allowable_rpm = allowableRPM;
    /* call to update and execute speed mode change on MCU */
    motor_control_changeSpeedMode();   // Note STM32MCP functions have been commented out for debugging purposes

    /* updates led display */
    led_display_setSpeedMode(speedMode);    // update led display
    /******  Dashboard services *************************************/
    /* updates speed mode Characteristic Value -> Mobile App */
    bat_dashboard_speedmode_service();

